# 백준 1011번 Fly me to the Alpha Centauri
n = int(input())

for i in range(n):
    a, b = map(int, input().split())
    distance = b - a
    n = 0
    while True:
        if distance <= n * (n+1):
            break
        n += 1
    
    if distance > n**2:
        print(n*2)
    else:
        print(n*2-1)

# 1 1 1 -> n ** 2
# 2 11 2 -> check n = 1
##############################
# 3 111 3
# 4 121 3 -> n ** 2
# 5 1211 4
# 6 1221 4 -> check n = 2
###############################
# 7 12211 5
# 8 12221 5 
# 9 12321 5 -> n ** 2
# 10 123211 6
# 11 123221 6
# 12 123321 6 -> check  n = 3
# 2, 4, 6, 8, 10... 즐가수 2*n 2씩 늘어남 등차수열 증가 수마다 마지막 거리 == 등차수열의 합
# 1, 2, 3, 4, 5.... 반복수 증가수/2
# (12) (3344) (555666) (77778888) (999991010101010)
